# Relatório de Análise II

## Tipos de Imóveis

In [36]:
import pandas as pd

In [37]:
dados = pd.read_csv('dados/aluguel.csv',sep=';')
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000.0,19193.0,3030.0

In [38]:
dados['Tipo']

0                      Quitinete
1                           Casa
2        Conjunto Comercial/Sala
3                    Apartamento
4                    Apartamento
5                    Apartamento
6                    Apartamento
7             Casa de Condomínio
8             Casa de Condomínio
9        Conjunto Comercial/Sala
10                   Apartamento
11                   Apartamento
12                   Apartamento
13                   Apartamento
14                     Quitinete
15                   Apartamento
16                Prédio Inteiro
17                          Flat
18            Casa de Condomínio
19                   Apartamento
20                   Apartamento
21                   Apartamento
22            Casa de Condomínio
23                   Apartamento
24                   Apartamento
25                          Flat
26       Conjunto Comercial/Sala
27                   Apartamento
28                   Apartamento
29                    Loja/Salão
                  ...
32930                Apartamento
32931                       Casa
32932                Apartamento
32933                Apartamento
32934                Apartamento
32935                Apartamento
32936                Apartamento
32937    Conjunto Comercial/Sala
32938                Apartamento
32939    Conjunto Comercial/Sala
32940                Apartamento
32941                Apartamento
32942    Conjunto Comercial/Sala
32943                Apartamento
32944                Apartamento
32945                  Quitinete
32946    Conjunto Comercial/Sala
32947                Apartamento
32948    Conjunto Comercial/Sala
32949                Apartamento
32950                Apartamento
32951                Apartamento
32952         Casa de Condomínio
32953                Apartamento
32954                Box/Garagem
32955                  Quitinete
32956                Apartamento
32957                Apartamento
32958                Apartamento
32959    Conjunto Comercial/Sala
Name: Tipo, Length: 32960, dtype: object

In [28]:
dados.Tipo

0                      Quitinete
1                           Casa
2        Conjunto Comercial/Sala
3                    Apartamento
4                    Apartamento
5                    Apartamento
6                    Apartamento
7             Casa de Condomínio
8             Casa de Condomínio
9        Conjunto Comercial/Sala
10                   Apartamento
11                   Apartamento
12                   Apartamento
13                   Apartamento
14                     Quitinete
15                   Apartamento
16                Prédio Inteiro
17                          Flat
18            Casa de Condomínio
19                   Apartamento
20                   Apartamento
21                   Apartamento
22            Casa de Condomínio
23                   Apartamento
24                   Apartamento
25                          Flat
26       Conjunto Comercial/Sala
27                   Apartamento
28                   Apartamento
29                    Loja/Salão
                  ...
32930                Apartamento
32931                       Casa
32932                Apartamento
32933                Apartamento
32934                Apartamento
32935                Apartamento
32936                Apartamento
32937    Conjunto Comercial/Sala
32938                Apartamento
32939    Conjunto Comercial/Sala
32940                Apartamento
32941                Apartamento
32942    Conjunto Comercial/Sala
32943                Apartamento
32944                Apartamento
32945                  Quitinete
32946    Conjunto Comercial/Sala
32947                Apartamento
32948    Conjunto Comercial/Sala
32949                Apartamento
32950                Apartamento
32951                Apartamento
32952         Casa de Condomínio
32953                Apartamento
32954                Box/Garagem
32955                  Quitinete
32956                Apartamento
32957                Apartamento
32958                Apartamento
32959    Conjunto Comercial/Sala
Name: Tipo, Length: 32960, dtype: object

In [39]:
tipo_de_imovel = dados['Tipo']

In [40]:
type(tipo_de_imovel)

pandas.core.series.Series

In [41]:
tipo_de_imovel.drop_duplicates()

0                          Quitinete
1                               Casa
2            Conjunto Comercial/Sala
3                        Apartamento
7                 Casa de Condomínio
16                    Prédio Inteiro
17                              Flat
29                        Loja/Salão
80           Galpão/Depósito/Armazém
83                    Casa Comercial
117                     Casa de Vila
159                   Terreno Padrão
207                      Box/Garagem
347                             Loft
589      Loja Shopping/ Ct Comercial
2157                         Chácara
3354           Loteamento/Condomínio
4379                           Sítio
4721                   Pousada/Chalé
6983                          Studio
9687                           Hotel
23614                      Indústria
Name: Tipo, dtype: object

In [42]:
tipo_de_imovel.drop_duplicates(inplace = True)

In [43]:
tipo_de_imovel

0                          Quitinete
1                               Casa
2            Conjunto Comercial/Sala
3                        Apartamento
7                 Casa de Condomínio
16                    Prédio Inteiro
17                              Flat
29                        Loja/Salão
80           Galpão/Depósito/Armazém
83                    Casa Comercial
117                     Casa de Vila
159                   Terreno Padrão
207                      Box/Garagem
347                             Loft
589      Loja Shopping/ Ct Comercial
2157                         Chácara
3354           Loteamento/Condomínio
4379                           Sítio
4721                   Pousada/Chalé
6983                          Studio
9687                           Hotel
23614                      Indústria
Name: Tipo, dtype: object

## Organizando a Visualização

In [44]:
tipo_de_imovel = pd.DataFrame(tipo_de_imovel)

In [45]:
tipo_de_imovel.index

Int64Index([    0,     1,     2,     3,     7,    16,    17,    29,    80,
               83,   117,   159,   207,   347,   589,  2157,  3354,  4379,
             4721,  6983,  9687, 23614],
           dtype='int64')

In [46]:
tipo_de_imovel.shape[0]

22

In [47]:
range(tipo_de_imovel.shape[0])

range(0, 22)

In [48]:
for i in range(tipo_de_imovel.shape[0]):
    print (i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21

In [49]:
tipo_de_imovel.index = range(tipo_de_imovel.shape[0])

In [50]:
tipo_de_imovel

                           Tipo
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

In [51]:
tipo_de_imovel.columns.name = 'ID'

In [52]:
tipo_de_imovel

ID                         Tipo
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

## Data Frame

In [54]:
data = [[1,2,3],[4,5,6],
       [7,8,9]]

In [55]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [56]:
df1 = pd.DataFrame(data)

In [57]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [58]:
index = ['Linha' + str(i) for i in range(3)]

In [59]:
index

['Linha0', 'Linha1', 'Linha2']

In [60]:
  df1 = pd.DataFrame(data,index = index)

In [61]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [62]:
columns = ['Coluna' + str(i) for i in range(3)]

In [63]:
 df1 = pd.DataFrame(data,index = index, columns = columns)

In [64]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [65]:
data = [(1,2,3),(4,5,6),
       (7,8,9)]

In [66]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [67]:
type(data)

list

In [68]:
 df3 = pd.DataFrame(data,index = index, columns = columns)

In [69]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [70]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [71]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [74]:
df4 = pd.concat([df1,df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [75]:
df4 = pd.concat([df1,df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       C       C       C
Linha1       A       A       A       C       C       C
Linha2       A       A       A       C       C       C

### Data Frame

In [76]:
data = [[1,2,3],[4,5,6],[7,8,9]]

In [77]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [78]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [79]:
index = ['Linha ' + str(i) for i in range(3)]
index

['Linha 0', 'Linha 1', 'Linha 2']

In [80]:
df1 = pd.DataFrame(data = data, index = index)
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [81]:
columns = ['Colunas ' + str(i) for i in range(3)]
columns

['Colunas 0', 'Colunas 1', 'Colunas 2']

In [82]:
df1 = pd.DataFrame(data = data, index = index, columns=columns)

In [83]:
df1

         Colunas 0  Colunas 1  Colunas 2
Linha 0          1          2          3
Linha 1          4          5          6
Linha 2          7          8          9

In [84]:
dados = [[1,2,3],[4,5,6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados,index=index, columns=columns)
df

   A  B  C
X  1  2  3
Y  4  5  6